// Напишите программу, которая заполнит спирально массив 4 на 4.

// Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, 
// добавляя индексы каждого элемента.
// Массив размером 2 x 2 x 2
// 66(0,0,0) 25(0,1,0)
// 34(1,0,0) 41(1,1,0)
// 27(0,0,1) 90(0,1,1)
// 26(1,0,1) 55(1,1,1)

void GetMatrix(int [,] matrix)
{
    int i = 0, j = 0; int n = 4;
    int value = 1;
    for (int e = 0; e < n * n; e++)
    {
        int k = 0;
        do { matrix[i, j++] = value++; } while (++k < n - 1);
        for (k = 0; k < n - 1; k++) matrix[i++, j] = value++;
        for (k = 0; k < n - 1; k++) matrix[i, j--] = value++;
        for (k = 0; k < n - 1; k++) matrix[i--, j] = value++;
        ++i; ++j;
        n = n < 2 ? 0 : n - 2;
    }
} 

void PrintMatrix(int[,] matrix)
{
   for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            if (matrix[i, j] < 10)
            {
                Console.Write("0" + matrix[i, j]);
                Console.Write(" ");
            }
            else Console.Write(matrix[i, j] + " ");
        }
        Console.WriteLine();
    }
}
int RowColomn = 4;
int[,] myMatrix = new int [RowColomn,RowColomn];
GetMatrix(myMatrix);
PrintMatrix(myMatrix);
Console.WriteLine();