// Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// a = 25, b = 5 -> да 
// a = 2, b = 10 -> нет 
// a = 9, b = -3 -> да 
// a = -3, b = 9 -> нет

Console.WriteLine("Введите число 1:");
Console.WriteLine("Введите число 2:");
if
{

}
Console.Write("Введите день недели: ");
string? Days = Console.ReadLine();
int IntDays = Convert.ToInt32(Days);

if (IntDays == 1)
{
    Console.WriteLine("Это понедельник");
}